hlissner/zsh-autopair
b4b4r07/enhancd
voronkovich/gitignore.plugin.zsh

robbyrussell/oh-my-zsh path:plugins/colored-man-pages

zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search

