adamsome.vscode-theme-gruvbox-minor
adpyke.codesnap
ardenivanov.svelte-intellisense
asvetliakov.vscode-neovim
Atishay-Jain.All-Autocomplete
austin.code-gnu-global
bungcip.better-toml
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dunstontc.viml
eg2.vscode-npm-script
esbenp.prettier-vscode
formulahendry.auto-rename-tag
formulahendry.docker-explorer
GitHub.github-vscode-theme
hashicorp.terraform
idleberg.applescript
jcbuisson.vue
jebbs.plantuml
Kelvin.vscode-sshfs
leizongmin.node-module-intellisense
michelemelluso.code-beautifier
mikestead.dotenv
mrmlnc.vscode-scss
ms-azuretools.vscode-docker
ms-python.python
ms-toolsai.jupyter
ms-vscode.cpptools
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
naumovs.color-highlight
octref.vetur
PKief.material-icon-theme
rust-lang.rust
sainnhe.gruvbox-material
streetsidesoftware.code-spell-checker
syler.sass-indented
teabyii.ayu
VisualStudioExptTeam.vscodeintellicode
yzhang.markdown-all-in-one
Zignd.html-css-class-completion
