# ------------------------------ PACKAGES -------------------------------------

tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
cask_args appdir: "/Applications"

# ------------------------------ DATABASE -------------------------------------

brew "mysql"
brew "sqlite"

# ------------------------------ LANGUAGE -------------------------------------

brew "lua"
brew "gcc"
brew "node"
brew "cmake"

# ------------------------------ TOOLING --------------------------------------

brew "ack"
brew "ag"
brew "bat"
brew "coreutils"
brew "dos2unix"
brew "fzf"
brew "fd"
brew "jq"
brew "tmux"
brew "vim"
brew "neovim"
brew "asdf"
brew "readline"
brew "tldr"
brew "git"
brew "exa"
brew "grep"
brew "gnu-sed"
brew "ripgrep"
brew "shellcheck"
brew "httpie"
brew "graphviz"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "zsh"
brew "zsh-completions"
brew "openssl"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "curl"
brew "htop"
brew "tree"
brew "neofetch"
brew "git-secrets"
brew "xz"
brew "pipx"
brew "pyqt"
brew "redis"
brew "gh"
brew "editorconfig"
brew "wget"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"

# ------------------------------ FONTS ----------------------------------------

tap  "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-firamono-nerd-font"
cask "font-firacode-nerd-font"

# ------------------------------ APPS -----------------------------------------

cask "docker"
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "slack"
cask "visual-studio-code"
cask "notion"
cask "spotify"
cask "hammerspoon"
cask "zoomus"
cask "discord"
cask "gpg-suite"
cask "sequel-pro"
cask "karabiner-elements"
cask "chromedriver"
cask "signal"
cask "obsidian"

mas "WeChat", id: 836500024
mas "Notability", id: 736189492
mas "NordVPN IKE", id: 1116599239
mas "NextDNS", id: 1464122853
mas "Day One", id: 1055511498